In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])

In [3]:
#dictionary
d={'a':10,'b':20,'c':30}
a=pd.Series(d)
a

a    10
b    20
c    30
dtype: int64

In [4]:
a['c']

30

In [5]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(index=labels,data=my_list)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels,my_list)

10    a
20    b
30    c
dtype: object

In [10]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],index=['USA','India','Egypt','UK'])

In [12]:
ser1

USA      1
India    2
Egypt    3
UK       4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],index=['USA','Germany','Africa','Nepal'])

In [14]:
ser2

USA        1
Germany    2
Africa     5
Nepal      4
dtype: int64

In [15]:
ser1['USA']

1

In [21]:
ser1+ser2

Africa     NaN
Egypt      NaN
Germany    NaN
India      NaN
Nepal      NaN
UK         NaN
USA        2.0
dtype: float64

# Data Frames

In [33]:
np.random.seed(10)

In [22]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [26]:
df

          W         X         Y         Z
A  0.642309 -0.696440  1.496924 -1.008768
B  1.344601 -1.177402  0.806704  1.733988
C -1.080869 -0.462549  0.304130  1.225309
D  1.720184  1.527042 -0.128088 -0.454549
E -0.068729  1.176388 -0.689314 -1.032838

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
df['W']['A']

0.6423091527677213

In [40]:
df['W']

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [41]:
df[['W','Z']]

          W         Z
A  1.331587 -0.008384
B  0.621336  0.108549
C  0.004291  1.203037
D -0.965066  0.445138
E -1.136602 -1.079805

In [42]:
df.W

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [30]:
df['new'] = df['W']+df['Y']

In [31]:
df

          W         X         Y         Z       new
A  0.642309 -0.696440  1.496924 -1.008768  2.139234
B  1.344601 -1.177402  0.806704  1.733988  2.151306
C -1.080869 -0.462549  0.304130  1.225309 -0.776738
D  1.720184  1.527042 -0.128088 -0.454549  1.592096
E -0.068729  1.176388 -0.689314 -1.032838 -0.758043

In [33]:

df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  0.642309 -0.696440  1.496924 -1.008768
B  1.344601 -1.177402  0.806704  1.733988
C -1.080869 -0.462549  0.304130  1.225309
D  1.720184  1.527042 -0.128088 -0.454549
E -0.068729  1.176388 -0.689314 -1.032838

In [34]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.642309 -0.696440  1.496924 -1.008768
B  1.344601 -1.177402  0.806704  1.733988
C -1.080869 -0.462549  0.304130  1.225309
D  1.720184  1.527042 -0.128088 -0.454549

In [35]:
df.loc['A']

W    0.642309
X   -0.696440
Y    1.496924
Z   -1.008768
Name: A, dtype: float64

In [36]:
df.iloc[2]

W   -1.080869
X   -0.462549
Y    0.304130
Z    1.225309
Name: C, dtype: float64

In [37]:
df.loc['B','Y']

0.8067044013721549

In [38]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.642309  1.496924
B  1.344601  0.806704

In [39]:
df>0

       W      X      Y      Z
A   True  False   True  False
B   True  False   True   True
C  False  False   True   True
D   True   True  False  False
E  False   True  False  False

In [40]:
df[df>0]

          W         X         Y         Z
A  0.642309       NaN  1.496924       NaN
B  1.344601       NaN  0.806704  1.733988
C       NaN       NaN  0.304130  1.225309
D  1.720184  1.527042       NaN       NaN
E       NaN  1.176388       NaN       NaN

In [41]:
df[df['W']>0]

          W         X         Y         Z
A  0.642309 -0.696440  1.496924 -1.008768
B  1.344601 -1.177402  0.806704  1.733988
D  1.720184  1.527042 -0.128088 -0.454549

In [42]:
df[df['W']>0] ['Y']

A    1.496924
B    0.806704
D   -0.128088
Name: Y, dtype: float64

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.642309 -0.696440  1.496924 -1.008768
1     B  1.344601 -1.177402  0.806704  1.733988
2     C -1.080869 -0.462549  0.304130  1.225309
3     D  1.720184  1.527042 -0.128088 -0.454549
4     E -0.068729  1.176388 -0.689314 -1.032838

In [44]:
newind='CA NY WY OR CO'.split()

In [45]:
df['index']=newind

In [46]:
df.set_index('index')

              W         X         Y         Z
index
CA     0.642309 -0.696440  1.496924 -1.008768
NY     1.344601 -1.177402  0.806704  1.733988
WY    -1.080869 -0.462549  0.304130  1.225309
OR     1.720184  1.527042 -0.128088 -0.454549
CO    -0.068729  1.176388 -0.689314 -1.032838